In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
data = {
    "company" : ["goog" , "goog" , "msft" , "msft" , "fb" , "fb"]  , 
    "person" : ["sam" , "amy" , "vanessa" , "carl" , "charlie" , "sarah"] , 
    "sales" : [200 , 120 , 254 , 132, 100 ,300 ]
}

df3 = pd.DataFrame(data)

In [3]:
df3

  company   person  sales
0    goog      sam    200
1    goog      amy    120
2    msft  vanessa    254
3    msft     carl    132
4      fb  charlie    100
5      fb    sarah    300

In [4]:
grouped = df3.groupby('company') 


grouped.sum()

         sales
company
fb         400
goog       320
msft       386

In [5]:
grouped.sum().loc['fb']

sales    400
Name: fb, dtype: int64

In [6]:
company_data = df3.groupby('company').describe().transpose()


company_data

company              fb        goog        msft
sales count    2.000000    2.000000    2.000000
      mean   200.000000  160.000000  193.000000
      std    141.421356   56.568542   86.267027
      min    100.000000  120.000000  132.000000
      25%    150.000000  140.000000  162.500000
      50%    200.000000  160.000000  193.000000
      75%    250.000000  180.000000  223.500000
      max    300.000000  200.000000  254.000000